run/constant/cathodeFluid/cathodeFluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/cathodeFluid";
    object      cathodeFluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Air (0.20*O2 + 0.65*N2 +0.15*H2O by mass) properties @ 353 K
air
{
    rho             rho     [1 -3 0 0 0 0 0]       0.9140;
    mu              mu      [1 -1 -1 0 0 0 0]   1.5158e-5;
    Cp              Cp      [0 2 -2 -1 0 0 0]     1108.85;
    k               k       [1 1 -3 -1 0 0 0]     0.02867;
}

cathodeLiquidWater
{
    rho             rho     [1 -3 0 0 0 0 0]      1000.0;
    mu              mu      [1 -1 -1 0 0 0 0]     1.0e-3;
    Cp              Cp      [0 2 -2 -1 0 0 0]     4190.0; // Gurau et al (1998)
    k               k       [1 1 -3 -1 0 0 0]        0.6; // Gurau et al (1998)
}

// hydraulic diameter for Reynolds Number calculation
// code will skip calculation if value = 0
//dHyd            dHyd    [0 1 0 0 0 0 0]      0;
dHyd            dHyd    [0 1 0 0 0 0 0]      1.0e-3;

diffusivity
{
    type        binaryFSG;
    Tname       T;
    pName       p;
    speciesA    O2;
    speciesB    N2;
    speciesC    H2O;
    // --------------------------------------
    //type        fixedDiffusivity;
    //diff0       diff0 [0 2 -1 0 0 0 0]  2.94e-5;
}

// ************************************************************************* //
