run/constant/electrolyte/activationParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/electrolyte";
    object      activationParameters;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// cathode

i0Reference    i0Reference    [0 -2 0 0 0 1 0]     1.39e-2;
ECathode       ECathode       [1 2 -2 0 -1 0 0]   7.322e+4;
alphaCathode   alphaCathode   [0 0 0 0 0 0 0]         1.0;

// ************************************************************************* //
