run/0/anodeFluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/anodeFluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    anodeFluidInlet
    {
        type            fixedValue;
        value           uniform (0 0 1.0);
    }

    anodeFluidOutlet
    {
        type            zeroGradient;
    }

    anodeFluidSides
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    agdlSides
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    
    aclSides
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
        
    anodeFluid_to_electrolyte //anode
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    anodeFluid_to_abp
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
