run/0/cathodeFluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/cathodeFluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325.0;

boundaryField
{

    cathodeFluidInlet
    {
        type            zeroGradient;
    }

    cathodeFluidOutlet
    {
        type            fixedValue;
        value           $internalField;
    }

    cathodeFluidSides
    {
        type            zeroGradient;
    }

    cgdlSides
    {
        type            zeroGradient;
    }

    cclSides
    {
        type            zeroGradient;
    }

    cathodeFluid_to_electrolyte //cathode
    {
        type            fixedGradient;
        gradient        uniform 0;
    }
    
    cathodeFluid_to_cbp
    {
        type            zeroGradient;
    }   
}

// ************************************************************************* //
