run/0/anodeFluid/S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/anodeFluid";
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.2;


boundaryField
{
    anodeFluidInlet
    {
        type              fixedValue;
        value              uniform 0;
    }

    anodeFluidOutlet
    {
        type            zeroGradient;
    }

    anodeFluidSides
    {
        type            zeroGradient;
    }

    agdlSides
    {
        type            zeroGradient;
    }

    aclSides
    {
        type            zeroGradient;
    }
    
    anodeFluid_to_electrolyte //anode
    {
        type            zeroGradient;
    }

    anodeFluid_to_abp
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
