run/0/cathodeFluid/S
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/cathodeFluid";
    object      S;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.2;

boundaryField
{

    cathodeFluidInlet
    {
        type              fixedValue;
        value              uniform 0;
    }

    cathodeFluidOutlet
    {
        type            zeroGradient;
    }

    cathodeFluidSides
    {
        type            zeroGradient;
    }

    cgdlSides
    {
        type            zeroGradient;
    }

    cclSides
    {
        type            zeroGradient;
    }

    cathodeFluid_to_electrolyte //cathode
    {
        type            zeroGradient;
    }
    
    cathodeFluid_to_cbp
    {
        type            zeroGradient;
    }   
}

// ************************************************************************* //
