run/0/cathodeFluid/diffO2air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/cathodeFluid";
    object      diffO2air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cathodeFluidInlet
    {
        type          fixedValue;
        value         uniform 1.0e-15;   // disallow outward diffusion at inlet
                                       // value 0 causes harmonic averaging FPE
    }

    cathodeFluidOutlet
    {
        type          zeroGradient;
    }

    cathodeFluidSides
    {
        type          zeroGradient;
    }

    cgdlSides
    {
        type          zeroGradient;
    }

    cclSides
    {
        type          zeroGradient;
    }

    cathodeFluid_to_electrolyte
    {
        type          zeroGradient;
    }

    cathodeFluid_to_cbp
    {
        type          zeroGradient;
    }
}

// ************************************************************************* //
