run/0/cathodeFluid/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/cathodeFluid";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0.9140;

boundaryField
{

    cathodeFluidInlet
    {
        type            fixedValue;
        value           $internalField;
    }

    cathodeFluidOutlet
    {
        type            zeroGradient;
    }

    cathodeFluidSides
    {
        type            zeroGradient;
    }

    cgdlSides
    {
        type            zeroGradient;
    }

    cclSides
    {
        type            zeroGradient;
    }

    cathodeFluid_to_electrolyte //cathode
    {
        type            zeroGradient;
    }
    
    cathodeFluid_to_cbp
    {
        type            zeroGradient;
    }   
}

// ************************************************************************* //
