run/system/cathodeFluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/cathodeFluid";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default    Gauss linear;
    grad(p)    Gauss linear;
}

divSchemes
{
    default          none;
    div(phiair,U)    Gauss GammaV 0.2;
    div(phiair,y)    Gauss upwind;
    div(phiair,S)    Gauss upwind;
}

laplacianSchemes
{
    default                    none;
    laplacian(mu,U)            Gauss harmonic corrected;
    laplacian((rho|A(U)),p)    Gauss linear corrected;
    laplacian(gamma,y)         Gauss harmonic corrected;
    laplacian(diff,y)          Gauss harmonic corrected;
    laplacian(diff,S)          Gauss linear corrected; // changed from harmonic
}

interpolationSchemes
{
    default             linear;
    interpolate(rho)    harmonic;
    interpolate(T)      harmonic;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}


// ************************************************************************* //
